---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode
source: html/ee98a836-6a40-db03-ef1e-655424d04a9a.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode

An enumerated type indicates the circuit path mode

## Syntax (C#)
```csharp
public enum ElectricalCircuitPathMode
```